In [3]:
import mysql.connector

remote = mysql.connector.connect(
    host = "database-1.c3mmsaki87vo.ap-northeast-2.rds.amazonaws.com",
    port = 3306,
    user = "admin",
    password = "rlawlswo1",
    database = "amrdb"
)
cursor = remote.cursor(buffered=True)

sql = "select * from celeb"
cursor.execute(sql)
result = list(cursor.fetchall())

duplist = []
for idx, i in enumerate(result):
    print(result[idx][5])
    duplist.append(str(result[idx][5]))

duplist = set(duplist)
duplist = list(duplist)
duplist

가수, 텔런트
가수
텔런트
영화배우, 텔런트
MC, 개그맨
영화배우, 모델
가수

['영화배우, 텔런트', '영화배우, 모델', 'MC, 개그맨', '가수, 텔런트', '가수', '텔런트']

In [4]:
result

[(1, '아이유', datetime.date(1993, 5, 16), 29, 'F', '가수, 텔런트', 'EDAM엔터테이먼트'),
 (2, '이미주', datetime.date(1994, 9, 23), 28, 'F', '가수', '울림엔터테이먼트'),
 (3, '송강', datetime.date(1994, 4, 23), 28, 'M', '텔런트', '나무엑터스'),
 (4, '강동원', datetime.date(1981, 1, 18), 41, 'M', '영화배우, 텔런트', 'YG엔터테이먼트'),
 (5, '유재석', datetime.date(1972, 8, 14), 50, 'M', 'MC, 개그맨', '안테나'),
 (6, '차승원', datetime.date(1970, 6, 7), 48, 'M', '영화배우, 모델', 'YG엔터테이먼트'),
 (7, '이수현', datetime.date(1999, 5, 4), 23, 'F', '가수', 'YG엔터테이먼트')]

In [ ]:
import mysql.connector

remote = mysql.connector.connect(
    host = "database-1.c3mmsaki87vo.ap-northeast-2.rds.amazonaws.com",
    port = 3306,
    user = "admin",
    password = "rlawlswo1",
    database = "amrdb"
)
cursor = remote.cursor(buffered=True)

sql = "select distinct sex from celeb"
cursor.execute(sql)
result = list(cursor.fetchall())
result[0][0]

IndexError: tuple index out of range

In [20]:
sql = "select distinct birthday from celeb order by birthday asc"
cursor.execute(sql)
result = list(cursor.fetchall())
end = str(result[-1][0])
end

'1999-05-04'